"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Отредактировать функцию n_sum, которая принимает целое число n, таким образом,
чтобы она возвращала n+nn+nnn

ПРИМЕРЫ
--------------------------------------------------------------------------------
n_sum(1) -> 3, т.к. 1+1+1=3
n_sum(3) -> 39, т.к. 3+9+27=39
"""


def n_sum(n: int) -> int:
  
    # Вычисляет формулу n+nn+nnn
    x = int(n+n*n+n*n*n)
    # :param n: некоторое целое число
    ## z = int(x)
    # :return: результат выполнения
   
    result = x
    return result


if __name__ == '__main__':
    n_number = int(input('Введите число n: '))
    print(f'Результат n+nn+nnn: {n_sum(n_number)}')
